## mesazon-apps-dev
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.gateway_core.digitalocean_app.app will be created
  + resource "digitalocean_app" "app" {
      + active_deployment_id = (known after apply)
      + created_at           = (known after apply)
      + default_ingress      = (known after apply)
      + deployment_per_page  = 20
      + id                   = (known after apply)
      + live_domain          = (known after apply)
      + live_url             = (known after apply)
      + project_id           = "5d792a15-cf5f-46c7-ab46-425f64c52ea4"
      + updated_at           = (known after apply)
      + urn                  = (known after apply)

      + dedicated_ips (known after apply)

      + spec {
          + disable_edge_cache              = false
          + disable_email_obfuscation       = false
          + domains                         = (known after apply)
          + enhanced_threat_control_enabled = false
          + features                        = (known after apply)
          + name                            = "gateway-core-fra1-dev"
          + region                          = "fra1"

          + domain (known after apply)

          + ingress (known after apply)

          + service {
              + http_port          = (known after apply)
              + instance_count     = 1
              + instance_size_slug = "apps-s-1vcpu-0.5gb"
              + internal_ports     = (known after apply)
              + name               = "gateway-core-service-fra1-dev"
              + run_command        = "tail -f /dev/null"

              + image {
                  + registry             = "eucm"
                  + registry_credentials = (sensitive value)
                  + registry_type        = "DOCKER_HUB"
                  + repository           = "noop"
                  + tag                  = "latest"

                  + deploy_on_push (known after apply)
                }

              + routes (known after apply)
            }
        }
    }

  # module.gateway_flyway.digitalocean_app.app will be created
  + resource "digitalocean_app" "app" {
      + active_deployment_id = (known after apply)
      + created_at           = (known after apply)
      + default_ingress      = (known after apply)
      + deployment_per_page  = 20
      + id                   = (known after apply)
      + live_domain          = (known after apply)
      + live_url             = (known after apply)
      + project_id           = "5d792a15-cf5f-46c7-ab46-425f64c52ea4"
      + updated_at           = (known after apply)
      + urn                  = (known after apply)

      + dedicated_ips (known after apply)

      + spec {
          + disable_edge_cache              = false
          + disable_email_obfuscation       = false
          + domains                         = (known after apply)
          + enhanced_threat_control_enabled = false
          + features                        = (known after apply)
          + name                            = "gateway-flyway-fra1-dev"
          + region                          = "fra1"

          + domain (known after apply)

          + ingress (known after apply)

          + job {
              + instance_count     = 1
              + instance_size_slug = "apps-s-1vcpu-0.5gb"
              + kind               = "UNSPECIFIED"
              + name               = "gateway-flyway-job-fra1-dev"

              + image {
                  + registry             = "eucm"
                  + registry_credentials = (sensitive value)
                  + registry_type        = "DOCKER_HUB"
                  + repository           = "noop"
                  + tag                  = "latest"

                  + deploy_on_push (known after apply)
                }
            }
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>